Repository: arqrepostxt/fluttermultilanguage
Catalog: lib/src/localization/app_*.arb
Languages: es, pt

# appTitle
source: My flutter_application_2
es: App Aleteo
pt: App flutter_2

source: Hello, World!!!
es: Mensaje de bienvenida hola mundo

source: Sample Item
es: Título de muestra
pt: Item exemplo

# sampleItemsTitle
source: Sample Items Header
es: Página de plantillas
pt: Página de Modelos de Itens

# itemDetailsTitle
source: Item Details
es: Detalles del artículo
pt: Detalhes do Item

# itemDetailsText
source: Nothing to show here
es: No hay detalhes del item
pt: Não há itens aqui

# systemTheme
source: Default System Theme
es: Tema del sistema
pt: Tema do sistema

source: Light Theme
es: El tema claro
pt: Tema claro

source: Dark Theme
es: El tema oscuro
pt: Tema escuro

# settingsTitle
source: Settings Page
es: La Página de configuración
pt: Página de Configurações

# settingsLocaleSelect
source: Select locale
es: Seleción de locale
pt: Seleção de idioma
